rost0031/STM32491-EVAL_QPC_FreeRTOS/src/app/gui/LCDConf.c
/* Private function prototypes -----------------------------------------------*/
static void LCD_AF_GPIOConfig(void);

static void DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat);
static void DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat);

DEFINEDMA2D_COLORCONVERSION(M8888I, LTDC_Pixelformat_ARGB8888)
DEFINEDMA2D_COLORCONVERSION(M888,   LTDC_Pixelformat_ARGB8888)
DEFINEDMA2D_COLORCONVERSION(M565,   LTDC_Pixelformat_RGB565)
DEFINEDMA2D_COLORCONVERSION(M1555I, LTDC_Pixelformat_ARGB1555)
DEFINEDMA2D_COLORCONVERSION(M4444I, LTDC_Pixelformat_ARGB4444)

/* Private functions ---------------------------------------------------------*/

/**
 * @brief
 * @param  LayerIndex: Layer index
 * @retval The LTDC Pixel format
 */
static U32 GetPixelformat(int LayerIndex) 
{
   //dbg_slow_printf("enter\n");
   const LCD_API_COLOR_CONV * pColorConvAPI;

   if (LayerIndex >= GUI_COUNTOF(apColorConvAPI))
   {
      return 0;
   }
   pColorConvAPI = apColorConvAPI[LayerIndex];

   if(pColorConvAPI == GUICC_M8888I)
   {
      return LTDC_Pixelformat_ARGB8888;
   }

   else if (pColorConvAPI == GUICC_M888)
   {
      return LTDC_Pixelformat_RGB888;
   }

   else if (pColorConvAPI == GUICC_M565)
   {
      return LTDC_Pixelformat_RGB565;
   }

   else if (pColorConvAPI == GUICC_M1555I)
   {
      return LTDC_Pixelformat_ARGB1555;
   }

   else if (pColorConvAPI == GUICC_M4444I)
   {
      return LTDC_Pixelformat_ARGB4444;
   }

   else if (pColorConvAPI == GUICC_8666)
   {
      return LTDC_Pixelformat_L8;
   }

   else if (pColorConvAPI == GUICC_1616I)
   {
      return LTDC_Pixelformat_AL44;
   }

   else if (pColorConvAPI == GUICC_88666I)
   {
      return LTDC_Pixelformat_AL88;
   }
   //dbg_slow_printf("BAD!!! no exit from here\n");
   while (1);
}

/**
 * @brief  Returns used Bytes per line in the selected layer
 * @param  LayerIndex: Layer index
 * @param  xSize: LCD width
 * @retval The calculated "Bytes per line" value
 */
static uint32_t GetBytesPerLine(uint32_t LayerIndex, uint32_t xSize) 
{
   uint32_t BitsPerPixel, BytesPerLine;

   BitsPerPixel  = LCD_GetBitsPerPixelEx(LayerIndex);
   BytesPerLine = (BitsPerPixel * xSize + 7) / 8;
   return BytesPerLine;
}

/**
 * @brief
 * @param  pColor
 * @param  NumItems
 * @retval None
 */
static void DMA_LoadLUT(LCD_COLOR * pColor, uint32_t NumItems) 
{
   DMA2D->FGCMAR  = (uint32_t)pColor;

   /*  Foreground PFC Control Register */
   DMA2D->FGPFCCR  = LTDC_Pixelformat_RGB888         /* Pixel format */
         | ((NumItems - 1) & 0xFF) << 8;   /* Number of items to load */
   DMA2D->FGPFCCR |= (1 << 5);                       /* Start loading */
}

/**
 * @brief
 * @param  pColorSrc: Source address
 * @param  pColorDst: Destination address
 * @param  NumItems
 * @retval None
 */
static void InvertAlpha_SwapRB(LCD_COLOR * pColorSrc, LCD_COLOR * pColorDst, uint32_t NumItems) 
{
   uint32_t Color;
   do
   {
      Color = *pColorSrc++;
      *pColorDst++ = ((Color & 0x000000FF) << 16)         /* Swap red <-> blue */
                       |  (Color & 0x0000FF00)                /* Green */
                       | ((Color & 0x00FF0000) >> 16)         /* Swap red <-> blue */
                       | ((Color & 0xFF000000) ^ 0xFF000000); /* Invert alpha */
   } while (--NumItems);
}

/**
 * @brief  Color format of DMA2D is different to STemWin color format. This routine
 *         inverts alpha that it is compatible to STemWin and vice versa
 * @param  pColorSrc
 * @param  pColorDst
 * @param  NumItems
 * @retval None
 */
static void InvertAlpha(LCD_COLOR * pColorSrc, LCD_COLOR * pColorDst, uint32_t NumItems) 
{
   uint32_t Color;

   do
   {
      Color = *pColorSrc++;
      *pColorDst++ = Color ^ 0xFF000000; /* Invert alpha */
   } while (--NumItems);
}

/**
 * @brief
 * @param  pColorFG
 * @param  pColorBG
 * @param  pColorDst
 * @param  NumItems
 * @retval None
 */
static void DMA_AlphaBlendingBulk(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, uint32_t NumItems) 
{
   /* Set up mode */
   DMA2D->CR      = 0x00020000UL | (1 << 9);         /* Control Register (Memory to memory with blending of FG and BG and TCIE) */

   /* Set up pointers */
   DMA2D->FGMAR   = (uint32_t)pColorFG;                   /* Foreground Memory Address Register */
   DMA2D->BGMAR   = (uint32_t)pColorBG;                   /* Background Memory Address Register */
   DMA2D->OMAR    = (uint32_t)pColorDst;                  /* Output Memory Address Register (Destination address) */

   /* Set up offsets */
   DMA2D->FGOR    = 0;                               /* Foreground Offset Register */
   DMA2D->BGOR    = 0;                               /* Background Offset Register */
   DMA2D->OOR     = 0;                               /* Output Offset Register */

   /* Set up pixel format */
   DMA2D->FGPFCCR = LTDC_Pixelformat_ARGB8888;       /* Foreground PFC Control Register (Defines the FG pixel format) */
   DMA2D->BGPFCCR = LTDC_Pixelformat_ARGB8888;       /* Background PFC Control Register (Defines the BG pixel format) */
   DMA2D->OPFCCR  = LTDC_Pixelformat_ARGB8888;       /* Output     PFC Control Register (Defines the output pixel format) */

   /* Set up size */
   DMA2D->NLR     = (uint32_t)(NumItems << 16) | 1;       /* Number of Line Register (Size configuration of area to be transfered) */

   /* Execute operation */

   DMA2D->CR     |= DMA2D_CR_START;

   while (DMA2D->CR & DMA2D_CR_START)
   {
   }
}

#if defined (__GNUC__) /*!< GNU Compiler */
#pragma GCC optimize ("O0")
#endif
/**
 * @brief  Function for mixing up 2 colors with the given intensity.
 *         If the background color is completely transparent the
 *         foreground color should be used unchanged.
 * @param  Color
 * @param  BkColor
 * @param  Intens
 * @retval LCD_COLOR
 */
static LCD_COLOR DMA_MixColors(LCD_COLOR Color, LCD_COLOR BkColor, U8 Intens) 
{
   uint32_t ColorFG, ColorBG, ColorDst;

   if ((BkColor & 0xFF000000) == 0xFF000000)
   {
      return Color;
   }
   ColorFG = Color   ^ 0xFF000000;
   ColorBG = BkColor ^ 0xFF000000;

   /* Set up mode */
   DMA2D->CR      = 0x00020000UL | (1 << 9);         /* Control Register (Memory to memory with blending of FG and BG and TCIE) */

   /* Set up pointers */
   DMA2D->FGMAR   = (uint32_t)&ColorFG;                   /* Foreground Memory Address Register */
   DMA2D->BGMAR   = (uint32_t)&ColorBG;                   /* Background Memory Address Register */
   DMA2D->OMAR    = (uint32_t)&ColorDst;                  /* Output Memory Address Register (Destination address) */

   /* Set up pixel format */
   DMA2D->FGPFCCR = LTDC_Pixelformat_ARGB8888
         | (1UL << 16)
         | ((uint32_t)Intens << 24);
   DMA2D->BGPFCCR = LTDC_Pixelformat_ARGB8888
         | (0UL << 16)
         | ((uint32_t)(255 - Intens) << 24);
   DMA2D->OPFCCR  = LTDC_Pixelformat_ARGB8888;

   /* Set up size */
   DMA2D->NLR     = (uint32_t)(1 << 16) | 1;              /* Number of Line Register (Size configuration of area to be transfered) */

   /* Execute operation */
   DMA2D->CR     |= DMA2D_CR_START;                       /* Control Register (Start operation) */

   /* Wait until transfer is done */
   while (DMA2D->CR & DMA2D_CR_START)
   {
   }

   return (ColorDst ^ 0xFF000000);
}

/**
 * @brief
 * @param  pSrc
 * @param  pDst
 * @param  PixelFormatSrc
 * @param  PixelFormatDst
 * @param  NumItems
 * @retval None
 */
static void DMA_ConvertColor(void * pSrc, void * pDst,  uint32_t PixelFormatSrc, uint32_t PixelFormatDst, uint32_t NumItems)
{
   /* Set up mode */

