rost0031/STM32491-EVAL_QPC_FreeRTOS/src/app/gui/LCDConf.c
   DMA2D->CR      = 0x00010000UL | (1 << 9);         /* Control Register (Memory to memory with pixel format conversion and TCIE) */

   /* Set up pointers */
   DMA2D->FGMAR   = (uint32_t)pSrc;                       /* Foreground Memory Address Register (Source address) */
   DMA2D->OMAR    = (uint32_t)pDst;                       /* Output Memory Address Register (Destination address) */

   /* Set up offsets */
   DMA2D->FGOR    = 0;                               /* Foreground Offset Register (Source line offset) */
   DMA2D->OOR     = 0;                               /* Output Offset Register (Destination line offset) */

   /* Set up pixel format */
   DMA2D->FGPFCCR = PixelFormatSrc;                  /* Foreground PFC Control Register (Defines the input pixel format) */
   DMA2D->OPFCCR  = PixelFormatDst;                  /* Output PFC Control Register (Defines the output pixel format) */

   /* Set up size */
   DMA2D->NLR     = (uint32_t)(NumItems << 16) | 1;       /* Number of Line Register (Size configuration of area to be transfered) */

   /* Execute operation */
   DMA2D->CR     |= DMA2D_CR_START;

   while (DMA2D->CR & DMA2D_CR_START)
   {
   }
}

/**
 * @brief  The STemWin function LCD_GetpPalConvTable() normally translates the given colors into
 *         index values for the display controller. In case of index based bitmaps without
 *         transparent pixels we load the palette only to the DMA2D LUT registers to be
 *         translated (converted) during the process of drawing via DMA2D.
 * @param  pLogPal
 * @param  pBitmap
 * @param  LayerIndex
 * @retval LCD_PIXELINDEX
 */
static LCD_PIXELINDEX * _LCD_GetpPalConvTable(const LCD_LOGPALETTE GUI_UNI_PTR * pLogPal, const GUI_BITMAP GUI_UNI_PTR * pBitmap, int LayerIndex)
{
   void (* pFunc)(void);
   int DoDefault = 0;

   /* Check if we have a non transparent device independent bitmap */
   if (pBitmap->BitsPerPixel == 8)
   {
      pFunc = LCD_GetDevFunc(LayerIndex, LCD_DEVFUNC_DRAWBMP_8BPP);
      if (pFunc)
      {
         if (pBitmap->pPal)
         {
            if (pBitmap->pPal->HasTrans)
            {
               DoDefault = 1;
            }
         }
         else
         {
            DoDefault = 1;
         }
      } 
      else 
      {
         DoDefault = 1;
      }
   }
   else
   {
      DoDefault = 1;
   }

   /* Default palette management for other cases */
   if (DoDefault)
   {

      /* Return a pointer to the index values to be used by the controller */
      return LCD_GetpPalConvTable(pLogPal);
   }

   /* Convert palette colors from ARGB to ABGR */
   InvertAlpha_SwapRB((U32 *)pLogPal->pPalEntries, aBufferDMA2D, pLogPal->NumEntries);

   /* Load LUT using DMA2D */
   DMA_LoadLUT(aBufferDMA2D, pLogPal->NumEntries);

   /* Return something not NULL */
   return aBufferDMA2D;
}


/**
 * @brief
 * @param  pColorFG
 * @param  pColorBG
 * @param  pColorDst
 * @param  Intens
 * @param  NumItems
 * @retval None
 */
static void DMA_MixColorsBulk(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, U8 Intens, uint32_t NumItems)
{
   //dbg_slow_printf("enter\n");
   /* Set up mode */
   DMA2D->CR      = 0x00020000UL | (1 << 9);         /* Control Register (Memory to memory with blending of FG and BG and TCIE) */

   /* Set up pointers */
   DMA2D->FGMAR   = (uint32_t)pColorFG;                   /* Foreground Memory Address Register */
   DMA2D->BGMAR   = (uint32_t)pColorBG;                   /* Background Memory Address Register */
   DMA2D->OMAR    = (uint32_t)pColorDst;                  /* Output Memory Address Register (Destination address) */

   /* Set up pixel format */
   DMA2D->FGPFCCR = LTDC_Pixelformat_ARGB8888
         | (1UL << 16)
         | ((uint32_t)Intens << 24);
   DMA2D->BGPFCCR = LTDC_Pixelformat_ARGB8888
         | (0UL << 16)
         | ((uint32_t)(255 - Intens) << 24);
   DMA2D->OPFCCR  = LTDC_Pixelformat_ARGB8888;

   /* Set up size */
   DMA2D->NLR     = (uint32_t)(NumItems << 16) | 1;              /* Number of Line Register (Size configuration of area to be transfered) */

   /* Execute operation */
   DMA2D->CR     |= DMA2D_CR_START;

   while (DMA2D->CR & DMA2D_CR_START)
   {
   }
   //dbg_slow_printf("exit\n");
}

/**
 * @brief
 * @param  pColorFG
 * @param  pColorBG
 * @param  pColorDst
 * @param  NumItems
 * @retval None
 */
static void DMA_AlphaBlending(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, U32 NumItems)
{
   /* Invert alpha values */
   InvertAlpha(pColorFG, aBuffer_FG, NumItems);
   InvertAlpha(pColorBG, aBuffer_BG, NumItems);

   /* Use DMA2D for mixing */
   DMA_AlphaBlendingBulk(aBuffer_FG, aBuffer_BG, aBufferDMA2D, NumItems);

   /* Invert alpha values */
   InvertAlpha(aBufferDMA2D, pColorDst, NumItems);
}


/**
 * @brief  This routine is used by the STemWin color conversion routines to use DMA2D for
 *         color conversion. It converts the given index values to 32 bit colors.
 *         Because STemWin uses ABGR internally and 0x00 and 0xFF for opaque and fully
 *         transparent the color array needs to be converted after DMA2D has been used.
 * @param  pIndex
 * @param  pColor
 * @param  NumItems
 * @param  SizeOfIndex
 * @param  PixelFormat
 * @retval None
 */
static void DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat)
{
   /* Use DMA2D for the conversion */
   DMA_ConvertColor(pIndex, aBufferDMA2D, PixelFormat, LTDC_Pixelformat_ARGB8888, NumItems);

   /* Convert colors from ARGB to ABGR and invert alpha values */
   InvertAlpha_SwapRB(aBufferDMA2D, pColor, NumItems);
}

/**
 * @brief  This routine is used by the STemWin color conversion routines to use DMA2D for
 *         color conversion. It converts the given 32 bit color array to index values.
 *         Because STemWin uses ABGR internally and 0x00 and 0xFF for opaque and fully
 *         transparent the given color array needs to be converted before DMA2D can be used.
 * @param  pColor
 * @param  pIndex
 * @param  NumItems
 * @param  SizeOfIndex
 * @param  PixelFormat
 * @retval None
 */
static void DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat) 
{
   /* Convert colors from ABGR to ARGB and invert alpha values */
   InvertAlpha_SwapRB(pColor, aBufferDMA2D, NumItems);

