rost0031/STM32491-EVAL_QPC_FreeRTOS/src/app/gui/LCDConf.c
   /* Use DMA2D for the conversion */
   DMA_ConvertColor(aBufferDMA2D, pIndex, LTDC_Pixelformat_ARGB8888, PixelFormat, NumItems);
}

/**
 * @brief
 * @param  pFG
 * @param  pBG
 * @param  pDst
 * @param  OffFG
 * @param  OffBG
 * @param  OffDest
 * @param  xSize
 * @param  ySize
 * @param  Intens
 * @retval None
 */
static void LCD_MixColorsBulk(U32 * pFG, U32 * pBG, U32 * pDst, unsigned OffFG, unsigned OffBG, unsigned OffDest, unsigned xSize, unsigned ySize, U8 Intens) {
   int y;

   GUI_USE_PARA(OffFG);
   GUI_USE_PARA(OffDest);
   for (y = 0; y < ySize; y++)
   {
      /* Invert alpha values */
      InvertAlpha(pFG, aBuffer_FG, xSize);
      InvertAlpha(pBG, aBuffer_BG, xSize);

      DMA_MixColorsBulk(aBuffer_FG, aBuffer_BG, aBufferDMA2D, Intens, xSize);

      InvertAlpha(aBufferDMA2D, pDst, xSize);
      pFG  += xSize + OffFG;
      pBG  += xSize + OffBG;
      pDst += xSize + OffDest;
   }
}

/**
 * @brief
 * @param  LTDC_Layerx
 * @param  NewState
 * @retval None
 */
static void LTDC_LayerEnableColorKeying(LTDC_Layer_TypeDef * LTDC_Layerx, int NewState)
{
   if (NewState != DISABLE)
   {
      LTDC_Layerx->CR |= (uint32_t)LTDC_LxCR_COLKEN;
   }
   else
   {
      LTDC_Layerx->CR &= ~(uint32_t)LTDC_LxCR_COLKEN;
   }
   LTDC->SRCR = LTDC_SRCR_VBR; /* Reload on next blanking period */
}

/**
 * @brief
 * @param  LayerIndex
 * @param  xPos
 * @param  yPos
 * @retval None
 */
static void LTDC_SetLayerPos(int LayerIndex, int xPos, int yPos)
{
   int xSize, ySize;
   uint32_t HorizontalStart, HorizontalStop, VerticalStart, VerticalStop;

   xSize = LCD_GetXSizeEx(LayerIndex);
   ySize = LCD_GetYSizeEx(LayerIndex);
   HorizontalStart = xPos + HBP + 1;
   HorizontalStop  = xPos + HBP + xSize;
   VerticalStart   = yPos + VBP + 1;
   VerticalStop    = yPos + VBP + ySize;

   /* Horizontal start and stop position */
   apLayer[LayerIndex]->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
   apLayer[LayerIndex]->WHPCR = (HorizontalStart | (HorizontalStop << 16));

   /* Vertical start and stop position */
   apLayer[LayerIndex]->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
   apLayer[LayerIndex]->WVPCR  = (VerticalStart | (VerticalStop << 16));

   /* Reload configuration */
   LTDC_ReloadConfig(LTDC_SRCR_VBR); /* Reload on next blanking period */
}

/**
 * @brief
 * @param  LayerIndex
 * @param  Alpha
 * @retval None
 */
static void LTDC_SetLayerAlpha(int LayerIndex, int Alpha)
{
   /* Set constant alpha value */
   apLayer[LayerIndex]->CACR &= ~(LTDC_LxCACR_CONSTA);
   apLayer[LayerIndex]->CACR  = 255 - Alpha;

   /* Reload configuration */
   LTDC_ReloadConfig(LTDC_SRCR_IMR);
}

/**
 * @brief
 * @param  LayerIndex
 * @param  Color
 * @param  Pos
 * @retval None
 */
static void LTDC_SetLUTEntry(int LayerIndex, uint32_t Color, int Pos) 
{
   //dbg_slow_printf("enter\n");
   uint32_t r, g, b, a;

   r = ( Color        & 0xff) << 16;
   g = ((Color >>  8) & 0xff) <<  8;
   b = ((Color >> 16) & 0xff);
   a = Pos << 24;
   apLayer[LayerIndex]->CLUTWR &= ~(LTDC_LxCLUTWR_BLUE | LTDC_LxCLUTWR_GREEN | LTDC_LxCLUTWR_RED | LTDC_LxCLUTWR_CLUTADD);
   apLayer[LayerIndex]->CLUTWR  = r | g | b | a;

   /* Reload configuration */
   LTDC_ReloadConfig(LTDC_SRCR_IMR);
   //dbg_slow_printf("exit\n");
}

/**
 * @brief  Copy a memory area content to another memory area
 * @param  LayerIndex: Layer index
 * @param  pSrc: Source address
 * @param  pDst: Destination address
 * @param  xSize: width of the area to be transfered
 * @param  ySize: height of the area to be transfered
 * @param  OffLineSrc: Source line offset
 * @param  OffLineDst: Destination line offset
 * @retval None
 */
static void DMA2D_Copy(uint32_t LayerIndex, void * pSrc, void * pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLineSrc, uint32_t OffLineDst)
{
   //dbg_slow_printf("enter\n");
   uint32_t PixelFormat;

   PixelFormat =  GetPixelformat(LayerIndex);
   DMA2D->CR      = 0x00000000UL | (1 << 9);              /* Memory to memory and TCIE                     */
   DMA2D->FGMAR   = (uint32_t)pSrc;                       /* Source address                                */
   DMA2D->OMAR    = (uint32_t)pDst;                       /* Destination address                           */
   DMA2D->FGOR    = OffLineSrc;                           /* Source line offset                            */
   DMA2D->OOR     = OffLineDst;                           /* Destination line offset                       */
   DMA2D->FGPFCCR = PixelFormat;                          /* Defines the number of pixels to be transfered */
   DMA2D->NLR     = (uint32_t)(xSize << 16) | (U16)ySize; /* Size configuration of area to be transfered   */
   DMA2D->CR     |= DMA2D_CR_START;                                    /* Start operation                               */

   while (DMA2D->CR & DMA2D_CR_START)
   {
   }
   //dbg_slow_printf("exit\n");
}

/**
 * @brief  Fill a color index into a memory area
 * @param  LayerIndex: Layer index
 * @param  pDst: Destination address
 * @param  xSize: width of the area to be transfered
 * @param  ySize: height of the area to be transfered
 * @param  OffLine: Destination line offset
 * @param  ColorIndex: Color to be used
 * @retval None
 */
static void DMA2D_Fill(uint32_t LayerIndex, void * pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
   //dbg_slow_printf("enter\n");
   uint32_t PixelFormat;

   PixelFormat = GetPixelformat(LayerIndex);
   DMA2D->CR      = 0x00030000UL | (1 << 9);              /* Register to memory and TCIE                   */
   DMA2D->OCOLR   = ColorIndex;                           /* Color to be used                              */
   DMA2D->OMAR    = (uint32_t)pDst;                       /* Destination address                           */
   DMA2D->OOR     = OffLine;                              /* Destination line offset                       */
   DMA2D->OPFCCR  = PixelFormat;                          /* Defines the number of pixels to be transfered */
   DMA2D->NLR     = (uint32_t)(xSize << 16) | (U16)ySize; /* Size configuration of area to be transfered   */
   DMA2D->CR     |= DMA2D_CR_START;                                    /* Start operation                               */

   while (DMA2D->CR & DMA2D_CR_START)
   {
   }
   //dbg_slow_printf("exit\n");
}

/**
 * @brief  LCD Low level initialization
 * @param  LayerIndex: Layer index
 * @retval None
 */
static void LCD_LL_Init(uint32_t LayerIndex) 
{
   //dbg_slow_printf("enter\n");
   uint32_t xSize, ySize, BytesPerLine, BitsPerPixel, i;
   uint32_t Color;
   static uint32_t Is_Initialized;

