rost0031/STM32491-EVAL_QPC_FreeRTOS/src/app/gui/LCDConf.c
   /* Set up offsets */
   DMA2D->FGOR    = OffSrc;                          /* Foreground Offset Register (Source line offset) */
   DMA2D->OOR     = OffDst;                          /* Output Offset Register (Destination line offset) */

   /* Set up pixel format */
   DMA2D->FGPFCCR = LTDC_Pixelformat_L8;             /* Foreground PFC Control Register (Defines the input pixel format) */
   DMA2D->OPFCCR  = PixelFormatDst;                  /* Output PFC Control Register (Defines the output pixel format) */

   /* Set up size */
   DMA2D->NLR     = (uint32_t)(xSize << 16) | ySize;      /* Number of Line Register (Size configuration of area to be transfered) */

   /* Execute operation */
   DMA2D->CR     |= DMA2D_CR_START;                               /* Start operation */

   /* Wait until transfer is done */
   while (DMA2D->CR & DMA2D_CR_START)
   {
   }
   //dbg_slow_printf("exit\n");
}

/**
 * @brief  Copy a memory area content to another memory area
 * @param  LayerIndex: Layer index
 * @param  IndexSrc: Source buffer index
 * @param  IndexDst: Destination buffer index
 * @retval None
 */
static void CUSTOM_LCD_CopyBuffer(uint32_t LayerIndex, uint32_t IndexSrc, uint32_t IndexDst) 
{
   uint32_t BufferSize, AddrSrc, AddrDst;

   BufferSize = GetBufferSize(LayerIndex);
   AddrSrc    = layer_address[LayerIndex] + BufferSize * IndexSrc;
   AddrDst    = layer_address[LayerIndex] + BufferSize * IndexDst;
   DMA2D_Copy(LayerIndex, (void *)AddrSrc, (void *)AddrDst, layer_xsize[LayerIndex], layer_ysize[LayerIndex], 0, 0);
   layer_buffer_index[LayerIndex] = IndexDst;
}

/**
 * @brief  Copy a rectangular memory area content to another memory area
 * @param  LayerIndex: Layer index
 * @param  x0: x coordinate of the source buffer index
 * @param  y0: y coordinate of the source buffer index
 * @param  x1: x coordinate of the destination buffer index
 * @param  y1: y coordinate of the destination buffer index
 * @param  xSize: width of the area to be transfered
 * @param  ySize: height of the area to be transfered
 * @retval None
 */
static void CUSTOM_LCD_CopyRect(uint32_t LayerIndex, uint32_t x0, uint32_t y0, uint32_t x1, uint32_t y1, uint32_t xSize, uint32_t ySize) 
{
   //dbg_slow_printf("enter\n");
   uint32_t BufferSize, AddrSrc, AddrDst;

   BufferSize = GetBufferSize(LayerIndex);
   AddrSrc = layer_address[LayerIndex] + BufferSize * layer_buffer_index[LayerIndex] + (y0 * layer_xsize[LayerIndex] + x0) * layer_bpp[LayerIndex];
   AddrDst = layer_address[LayerIndex] + BufferSize * layer_buffer_index[LayerIndex] + (y1 * layer_xsize[LayerIndex] + x1) * layer_bpp[LayerIndex];
   DMA2D_Copy(LayerIndex, (void *)AddrSrc, (void *)AddrDst, xSize, ySize, layer_xsize[LayerIndex] - xSize, 0);
   //dbg_slow_printf("exit\n");
}

/**
 * @brief  Fill a pixel index into a memory area
 * @param  LayerIndex: Layer index
 * @param  x0: x coordinate of the source buffer index
 * @param  y0: y coordinate of the source buffer index
 * @param  x1: x coordinate of the destination buffer index
 * @param  y1: y coordinate of the destination buffer index
 * @param  PixelIndex: Pixel Index
 * @retval None
 */
static void CUSTOM_LCD_FillRect(uint32_t LayerIndex, uint32_t x0, uint32_t y0, uint32_t x1, uint32_t y1, uint32_t PixelIndex) 
{
   //dbg_slow_printf("enter\n");
   uint32_t BufferSize, AddrDst;
   uint32_t xSize, ySize;

   if (GUI_GetDrawMode() == GUI_DM_XOR)
   {
      LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, NULL);
      LCD_FillRect(x0, y0, x1, y1);
      LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, (void(*)(void))CUSTOM_LCD_FillRect);
   }
   else
   {
      xSize = x1 - x0 + 1;
      ySize = y1 - y0 + 1;
      BufferSize = GetBufferSize(LayerIndex);
      AddrDst = layer_address[LayerIndex] + BufferSize * layer_buffer_index[LayerIndex] + (y0 * layer_xsize[LayerIndex] + x0) * layer_bpp[LayerIndex];
      DMA2D_Fill(LayerIndex, (void *)AddrDst, xSize, ySize, layer_xsize[LayerIndex] - xSize, PixelIndex);
   }
   //dbg_slow_printf("exit\n");
}

/**
 * @brief
 * @param  LayerIndex
 * @param  x
 * @param  y
 * @param  p
 * @param  xSize
 * @param  ySize
 * @param  BytesPerLine
 * @retval None
 */
static void LCD_DrawBitmap16bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine)
{
   //dbg_slow_printf("enter\n");
   uint32_t BufferSize, AddrDst;
   int OffLineSrc, OffLineDst;

   BufferSize = GetBufferSize(LayerIndex);
   AddrDst = layer_address[LayerIndex] + BufferSize * layer_buffer_index[LayerIndex] + (y * layer_xsize[LayerIndex] + x) * layer_bpp[LayerIndex];
   OffLineSrc = (BytesPerLine / 2) - xSize;
   OffLineDst = layer_xsize[LayerIndex] - xSize;
   DMA2D_Copy(LayerIndex, (void *)p, (void *)AddrDst, xSize, ySize, OffLineSrc, OffLineDst);
   //dbg_slow_printf("exit\n");
}

/**
 * @brief
 * @param  LayerIndex
 * @param  x
 * @param  y
 * @param  p
 * @param  xSize
 * @param  ySize
 * @param  BytesPerLine
 * @retval None
 */
static void LCD_DrawBitmap8bpp(int LayerIndex, int x, int y, U8 const * p, int xSize, int ySize, int BytesPerLine)
{
   //dbg_slow_printf("enter\n");
   uint32_t BufferSize, AddrDst;
   int OffLineSrc, OffLineDst;
   uint32_t PixelFormat;

   BufferSize = GetBufferSize(LayerIndex);
   AddrDst = layer_address[LayerIndex] + BufferSize * layer_buffer_index[LayerIndex] + (y * layer_xsize[LayerIndex] + x) * layer_bpp[LayerIndex];
   OffLineSrc = BytesPerLine - xSize;
   OffLineDst = layer_xsize[LayerIndex] - xSize;
   PixelFormat = GetPixelformat(LayerIndex);
   DMA_DrawBitmapL8((void *)p, (void *)AddrDst, OffLineSrc, OffLineDst, PixelFormat, xSize, ySize);
   //dbg_slow_printf("exit\n");
}

/**
 * @brief  Transfer complete interrupt of DMA2D
 * @param  None
 * @retval None
 */
void DMA2D_ISR_Handler(void)
{
//   QK_ISR_ENTRY();                          /* inform QK-nano about ISR entry */
   //dbg_slow_printf("enter\n");
   DMA2D->IFCR = (U32)DMA2D_IFSR_CTCIF;
//   dbg_slow_printf("exit\n");
//   QK_ISR_EXIT();                            /* inform QK-nano about ISR exit */
}

/**
 * @brief  End-Of-Frame-Interrupt for managing multiple buffering
 * @param  None
 * @retval None
 */
void LTDC_ISR_Handler(void) 
{
//   QK_ISR_ENTRY();                          /* inform QK-nano about ISR entry */
//   dbg_slow_printf("enter\n");
   uint32_t Addr;
   uint32_t i;

   LTDC->ICR = (uint32_t)LTDC_IER_LIE;
   for (i = 0; i < GUI_NUM_LAYERS; i++)
   {
      if (layer_pending_buffer[i] >= 0)
      {
         Addr = layer_address[i] + layer_xsize[i] * layer_ysize[i] * layer_pending_buffer[i] * layer_bpp[i];

         LTDC_LayerAddress((i == 0 ? LTDC_Layer1 : LTDC_Layer2), Addr);
         LTDC_ReloadConfig(LTDC_IMReload);

