rost0031/STM32491-EVAL_QPC_FreeRTOS/src/app/gui/LCDConf.c
         GUI_MULTIBUF_ConfirmEx(i, layer_pending_buffer[i]);

         layer_pending_buffer[i] = -1;
      }
   }
//   dbg_slow_printf("exit\n");
//   QK_ISR_EXIT();                            /* inform QK-nano about ISR exit */
}

/**
 * @brief  This function is called by the display driver for several purposes.
 *         To support the according task the routine needs to be adapted to
 *         the display controller.
 * @param  LayerIndex: Index of layer to be configured
 * @param  Cmd: Please refer to the details in the switch statement below
 * @param  pData: Pointer to a LCD_X_DATA structure
 * @retval  < -1: Error
 *          -1  : Command not handled
 *          0   : Ok
 */
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void * pData)
{

//   dbg_slow_printf("enter with cmd %d\n", Cmd);
   int r = 0;
   int xPos, yPos;

   switch (Cmd) {
      case LCD_X_INITCONTROLLER: {
         dbg_slow_printf("LCD_X_INITCONTROLLER\n");
         /* Called during the initialization process in order to set up the display controller and put it into operation */
         LCD_LL_Init(LayerIndex);
         break;
      }
      case LCD_X_SETORG: {
         //dbg_slow_printf("LCD_X_SETORG\n");
         /* Required for setting the display origin which is passed in the 'xPos' and 'yPos' element of p */
         LCD_X_SETORG_INFO * p;

         p = (LCD_X_SETORG_INFO *)pData;

         apLayer[LayerIndex]->CFBAR = layer_address[LayerIndex] + p->yPos * layer_xsize[LayerIndex] * layer_bpp[LayerIndex];
         LTDC_ReloadConfig(LTDC_SRCR_VBR); // Reload on next blanking period
         break;
      }
      case LCD_X_SHOWBUFFER: {
         //dbg_slow_printf("LCD_X_SHOWBUFFER\n");
         /* Required if multiple buffers are used. The 'Index' element of p contains the buffer index */
         LCD_X_SHOWBUFFER_INFO * p;

         p = (LCD_X_SHOWBUFFER_INFO *)pData;
         layer_pending_buffer[LayerIndex] = p->Index;
         break;
      }
      case LCD_X_SETLUTENTRY: {
         //dbg_slow_printf("LCD_X_SETLUTENTRY\n");
         /* Required for setting a lookup table entry which is passed in the 'Pos' and 'Color' element of p */
         LCD_X_SETLUTENTRY_INFO * p;

         p = (LCD_X_SETLUTENTRY_INFO *)pData;
         LTDC_SetLUTEntry(LayerIndex, p->Color, p->Pos);
         break;
      }
      case LCD_X_ON: {
         //dbg_slow_printf("LCD_X_ON\n");
         /* Required if the display controller should support switching on and off */
         LTDC_Cmd(ENABLE); /* display ON */
         //dbg_slow_printf("Finished\n");
         break;
      }
      case LCD_X_OFF: {
         //dbg_slow_printf("LCD_X_OFF\n");
         /* Required if the display controller should support switching on and off */
         LTDC_Cmd(DISABLE); /* display OFF */
         break;
      }
      case LCD_X_SETVIS: {
         //dbg_slow_printf("LCD_X_SETVIS\n");
         /* Required for setting the layer visibility which is passed in the 'OnOff' element of pData */
         LCD_X_SETVIS_INFO * p;

         p = (LCD_X_SETVIS_INFO *)pData;
         LTDC_LayerCmd(apLayer[LayerIndex], p->OnOff ? ENABLE : DISABLE);

         /* Reload shadow register */
         LTDC_ReloadConfig(LTDC_SRCR_IMR);
         break;
      }
      case LCD_X_SETPOS: {
         //dbg_slow_printf("LCD_X_SETPOS\n");
         /* Required for setting the layer position which is passed in the 'xPos' and 'yPos' element of pData */
         LCD_X_SETPOS_INFO * p;

         p = (LCD_X_SETPOS_INFO *)pData;
         LTDC_SetLayerPos(LayerIndex, p->xPos, p->yPos);
         break;
      }
      case LCD_X_SETSIZE: {
         //dbg_slow_printf("LCD_X_SETSIZE\n");
         /* Required for setting the layer position which is passed in the 'xPos' and 'yPos' element of pData */
         LCD_X_SETSIZE_INFO * p;


         GUI_GetLayerPosEx(LayerIndex, &xPos, &yPos);
         p = (LCD_X_SETSIZE_INFO *)pData;
         layer_xsize[LayerIndex] = p->xSize;
         layer_ysize[LayerIndex] = p->ySize;
         LTDC_SetLayerPos(LayerIndex, xPos, yPos);
         break;
      }
      case LCD_X_SETALPHA: {
         //dbg_slow_printf("LCD_X_SETALPHA\n");
         /* Required for setting the alpha value which is passed in the 'Alpha' element of pData */
         LCD_X_SETALPHA_INFO * p;

         p = (LCD_X_SETALPHA_INFO *)pData;
         LTDC_SetLayerAlpha(LayerIndex, p->Alpha);
         break;
      }
      case LCD_X_SETCHROMAMODE: {
         //dbg_slow_printf("LCD_X_SETCHROMAMODE\n");
         /* Required for setting the chroma mode which is passed in the 'ChromaMode' element of pData */
         LCD_X_SETCHROMAMODE_INFO * p;

         p = (LCD_X_SETCHROMAMODE_INFO *)pData;
         LTDC_LayerEnableColorKeying(apLayer[LayerIndex], (p->ChromaMode != 0) ? ENABLE : DISABLE);
         break;
      }
      case LCD_X_SETCHROMA: {
         //dbg_slow_printf("LCD_X_SETCHROMA\n");
         /* Required for setting the chroma value which is passed in the 'ChromaMin' and 'ChromaMax' element of pData */
         LCD_X_SETCHROMA_INFO * p;
         U32 Color;

         p = (LCD_X_SETCHROMA_INFO *)pData;
         Color = ((p->ChromaMin & 0xFF0000) >> 16) | (p->ChromaMin & 0x00FF00) | ((p->ChromaMin & 0x0000FF) << 16);
         apLayer[LayerIndex]->CKCR = Color;
         LTDC_ReloadConfig(LTDC_SRCR_VBR); // Reload on next blanking period
         break;
      }
      default:
         r = -1;
   }
   //dbg_slow_printf("exit\n");
   return r;
}

/**
 * @brief  Called during the initialization process in order to set up the
 *         display driver configuration.
 * @param  None
 * @retval None
 */
void LCD_X_Config(void) 
{
   //dbg_slow_printf("enter\n");
   uint32_t i;

   /* At first initialize use of multiple buffers on demand */
#if (NUM_BUFFERS > 1)
   for (i = 0; i < GUI_NUM_LAYERS; i++) {
      GUI_MULTIBUF_ConfigEx(i, NUM_BUFFERS);
   }
#endif

   /* Set display driver and color conversion for 1st layer */
   GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_0, COLOR_CONVERSION_0, 0, 0);

   /* Set size of 1st layer */
   if (LCD_GetSwapXYEx(0)) {
      LCD_SetSizeEx (0, YSIZE_0, XSIZE_0);
      LCD_SetVSizeEx(0, YSIZE_0 * NUM_VSCREENS, XSIZE_0);
   } else {
      LCD_SetSizeEx (0, XSIZE_0, YSIZE_0);
      LCD_SetVSizeEx(0, XSIZE_0, YSIZE_0 * NUM_VSCREENS);
   }

#if (GUI_NUM_LAYERS > 1)
   /* Set display driver and color conversion for 2nd layer */
   GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_1, COLOR_CONVERSION_1, 0, 1);

   /* Set size of 2nd layer */
   if (LCD_GetSwapXYEx(0)) {
      LCD_SetSizeEx (1, YSIZE_1, XSIZE_1);
      LCD_SetVSizeEx(1, YSIZE_1 * NUM_VSCREENS, XSIZE_1);
   } else {
      LCD_SetSizeEx (1, XSIZE_1, YSIZE_1);
      LCD_SetVSizeEx(1, XSIZE_1, YSIZE_1 * NUM_VSCREENS);
   }
#endif

   /*Initialize GUI Layer structure */
   layer_address[0] = LCD_LAYER0_FRAME_BUFFER;
#if (GUI_NUM_LAYERS > 1)
   layer_address[1] = LCD_LAYER1_FRAME_BUFFER;
#endif

   /* Setting up VRam address and custom functions for CopyBuffer-, CopyRect- and FillRect operations */
   for (i = 0; i < GUI_NUM_LAYERS; i++) {
      layer_pending_buffer[i] = -1;

      /* Set VRAM address */
      LCD_SetVRAMAddrEx(i, (void *)(layer_address[i]));

      /* Remember color depth for further operations */
      layer_bpp[i] = LCD_GetBitsPerPixelEx(i) >> 3;

