rost0031/STM32491-EVAL_QPC_FreeRTOS/src/app/gui/LCDConf.c
      /* Set custom functions for several operations */
      LCD_SetDevFunc(i, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))CUSTOM_LCD_CopyBuffer);
      LCD_SetDevFunc(i, LCD_DEVFUNC_COPYRECT,   (void(*)(void))CUSTOM_LCD_CopyRect);

      /* Filling via DMA2D does only work with 16bpp or more */
      if (GetPixelformat(i) <= LTDC_Pixelformat_ARGB4444) {
         LCD_SetDevFunc(i, LCD_DEVFUNC_FILLRECT, (void(*)(void))CUSTOM_LCD_FillRect);
         LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_8BPP, (void(*)(void))LCD_DrawBitmap8bpp);
      }

      /* Set up drawing routine for 16bpp bitmap using DMA2D */
      if (GetPixelformat(i) == LTDC_Pixelformat_RGB565) {
         LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_16BPP, (void(*)(void))LCD_DrawBitmap16bpp);     /* Set up drawing routine for 16bpp bitmap using DMA2D. Makes only sense with RGB565 */
      }

      /* Set up custom color conversion using DMA2D, works only for direct color modes because of missing LUT for DMA2D destination */
      GUICC_M1555I_SetCustColorConv(Color2IndexBulk_M1555IDMA2D, _Index2ColorBulk_M1555IDMA2D); /* Set up custom bulk color conversion using DMA2D for ARGB1555 */
      GUICC_M565_SetCustColorConv  (Color2IndexBulk_M565DMA2D,   _Index2ColorBulk_M565DMA2D);   /* Set up custom bulk color conversion using DMA2D for RGB565 */
      GUICC_M4444I_SetCustColorConv(Color2IndexBulk_M4444IDMA2D, _Index2ColorBulk_M4444IDMA2D); /* Set up custom bulk color conversion using DMA2D for ARGB4444 */
      GUICC_M888_SetCustColorConv  (Color2IndexBulk_M888DMA2D,   _Index2ColorBulk_M888DMA2D);   /* Set up custom bulk color conversion using DMA2D for RGB888 */
      GUICC_M8888I_SetCustColorConv(Color2IndexBulk_M8888IDMA2D, _Index2ColorBulk_M8888IDMA2D); /* Set up custom bulk color conversion using DMA2D for ARGB8888 */

      /* Set up custom alpha blending function using DMA2D */
      GUI_SetFuncAlphaBlending(DMA_AlphaBlending);                                                /* Set up custom alpha blending function using DMA2D */

      /* Set up custom function for translating a bitmap palette into index values.
    Required to load a bitmap palette into DMA2D CLUT in case of a 8bpp indexed bitmap */
      GUI_SetFuncGetpPalConvTable(_LCD_GetpPalConvTable);

      /* Set up a custom function for mixing up single colors using DMA2D */
      GUI_SetFuncMixColors(DMA_MixColors);

      /* Set up a custom function for mixing up arrays of colors using DMA2D */
      GUI_SetFuncMixColorsBulk(LCD_MixColorsBulk);
   }
   //dbg_slow_printf("exit\n");
}

/**
 * @brief GPIO config for LTDC.
 * @param  None
 * @retval None
 */
static void LCD_AF_GPIOConfig(void)
{
   //dbg_slow_printf("enter\n");
   GPIO_InitTypeDef GPIO_InitStruct;

   /* Enable GPIOI, GPIOJ, GPIOG, GPIOF, GPIOH AHB Clocks */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOI | RCC_AHB1Periph_GPIOJ | \
         RCC_AHB1Periph_GPIOK | RCC_AHB1Periph_GPIOC | \
         RCC_AHB1Periph_GPIOA,  ENABLE);

   /* GPIO I configuration */
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource12, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource13, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource14, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOI, GPIO_PinSource15, GPIO_AF_LTDC);

   GPIO_InitStruct.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;

   GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_Init(GPIOI, &GPIO_InitStruct);

   /* GPIOJ configuration */
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource0, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource1, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource2, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource3, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource4, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource5, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource6, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource7, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource8, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource9, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource10, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource11, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource12, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource13, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource14, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOJ, GPIO_PinSource15, GPIO_AF_LTDC);

   GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | \
         GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 | \
         GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 | \
         GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;

   GPIO_Init(GPIOJ, &GPIO_InitStruct);

   /* GPIO K configuration */
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource0, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource1, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource2, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource3, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource4, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource5, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource6, GPIO_AF_LTDC);
   GPIO_PinAFConfig(GPIOK, GPIO_PinSource7, GPIO_AF_LTDC);

   GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | \
         GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;

   GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_Init(GPIOK, &GPIO_InitStruct);

   /* GPIOC configuration */
   GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6;

   GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
   GPIO_InitStruct.GPIO_OType = GPIO_OType_OD;
   GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_Init(GPIOC, &GPIO_InitStruct);

   /* GPIOA configuration */
   GPIO_InitStruct.GPIO_Pin = GPIO_Pin_8;

   GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
   GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
   GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_Init(GPIOA, &GPIO_InitStruct);
   //dbg_slow_printf("exit\n");
}
/*************************** End of file ****************************/
